[
  {
    "Session Id":843163,
    "Title":"Service Design e accessibilità per i siti Web",
    "Description":"In questo intervento, rivolto a programmatori, verranno introdotti i concetti di Service Design e di accessibilità applicati ai siti Web. Per farlo parleremo di tubi dell'acqua (calda e fredda) e rubinetti, pentole per scolare la pasta e di bias (come il survivorship bias) per capire, con esempi \"lontani\" dall'ambito informatico, in quali tranelli potrebbe cadere un programmatore se ragiona da \"tecnologo\". Dopo un'introduzione dedicata al Service Design vedremo com'è nato l'HTML e perché era (ora non più!) tollerabile scrivere qualsiasi cosa (anche sbagliata) dentro un sito Web. Cercheremo di capire come mai il legislatore da più di 20 anni (2004) abbia imposto l'accessibilità come requisito per i siti Web della pubblica amministrazione e come questa non sia più una feature tra le tante desiderate ma diventa norma di legge, anche per tutti i siti commerciali, a partire da giugno 2025. Verrà fatto cenno ad alcuni requisiti delle norme tecniche (WCAG) e ad alcuni semplici esempi di pagine non accessibili. La conoscenza, anche di base, di HTML è gradita ma non è strettamente necessaria per poter comprendere i concetti esposti.",
    "Owner":"Ivan Venuti",
    "Owner Email":"ivanvenuti@gmail.com",
    "Speakers":"Ivan Venuti",
    "Category":"Web",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italia",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T13:13:44.423",
    "Room":null,
    "Scheduled At":null,
    "Scheduled Duration":null,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"493590fc-c38a-4f7f-b76f-e81d7cf6207a"
  },
  {
    "Session Id":906812,
    "Title":"Explainable ML 101: come rendere chiaro il tuo modello Black Box",
    "Description":"La rapida crescita del machine learning ha reso possibile sviluppare applicazioni con modelli complessi capaci di risultati straordinari._x000D_\n_x000D_\nTuttavia, sebbene i modelli black box (scatola nera) abbiano conosciuto una crescita esplosiva, è molto difficile comprenderne le relazioni interne, rendendoli inadatti alla comprensione dei dati o all’utilizzo in contesti critici (ad esempio, in ambito medico)._x000D_\n_x000D_\nI modelli spiegabili, al contrario, sono molto più comprensibili, sia per la loro semplicità che per l’utilizzo di metriche interne facilmente interpretabili, ma in genere risultano molto meno potenti rispetto ai modelli black box._x000D_\n_x000D_\nNon sarebbe fantastico poter “collegare” un modello spiegabile a un modello black box per comprendere i risultati e le motivazioni dietro le scelte fatte dal modello?_x000D_\n_x000D_\nIn questa sessione esploreremo i fondamenti dei modelli spiegabili e come aggiungere una \"testa spiegabile\" al tuo modello black box.",
    "Owner":"Leonardo Dipilato",
    "Owner Email":"leonardipilato@gmail.com",
    "Speakers":"Leonardo Dipilato",
    "Category":"AI",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"No",
    "Owner Confirmed":"No",
    "Room":null,
    "Scheduled At":null,
    "Scheduled Duration":null,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"e582e797-64a8-46b9-94fe-23bdcca5f525"
  },
  {
    "Session Id":850062,
    "Title":"Breaking Free from the Need for Male Approval in Professional Growth",
    "Description":"Women in the workplace often face an unspoken pressure to seek validation from male colleagues, leaders, or industry gatekeepers. This need for approval can shape career decisions, limit ambition, and reinforce self-doubt. But what happens when we stop waiting for permission and start defining success on our own terms?_x000D_\n_x000D_\nThis session is about breaking free from external validation and stepping into authentic, self-driven leadership. We’ll explore how societal conditioning influences professional growth, why women are often held to different standards of approval, and how to redefine confidence and authority without the need for male endorsement._x000D_\n_x000D_\nAttendees will walk away with:_x000D_\n_x000D_\nPractical strategies to shift from external validation to self-trust in decision-making._x000D_\nHow to navigate bias and double standards without shrinking or over-explaining._x000D_\nA mindset framework to own your expertise, advocate for yourself, and advance confidently._x000D_\nTools to build influence and credibility without conforming to outdated workplace norms.",
    "Owner":"Jennifer D. Daniel",
    "Owner Email":"contactjennydan@gmail.com",
    "Speakers":"Jennifer D. Daniel",
    "Category":"Soft Skills",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"united kingdom",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-03-04T16:43:42.703",
    "Room":"Sala Fibonacci",
    "Scheduled At":"2025-04-12T10:00:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"2c19cb7e-ebbb-4b03-87f1-4a3b60296cac"
  },
  {
    "Session Id":860330,
    "Title":"AI + A11Y = Surfa il web senza tavola...e senza mani!",
    "Description":"E se al posto di usare il mouse, potessimo navigare le nostre pagine facendo l'occhiolino o con il movimento della testa? Può una Chrome Extension cambiare il modo di usare il proprio browser?_x000D_\n_x000D_\nGrazie all'AI ed ai modelli \"on the edge\", è possibile provare nuove frontiere di navigazione del web, utili magari a chi non ha la possibilità di usare le mani come vorrebbe!_x000D_\nUn esperimento utile, navigando con le sole espressioni facciali, per comprendere un nuovo modo di concepire l'uso dei dispositivi rendendo ancora più accessibile ciò che non lo era._x000D_\n_x000D_\nLa strada è ancora lunga...ma perlomeno è tracciata!",
    "Owner":"Francesco Sciuti",
    "Owner Email":"francesco@acadevmy.it",
    "Speakers":"Francesco Sciuti",
    "Category":"AI",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"Yes, and I will be applying with Google's speaker program",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-27T07:45:38.880",
    "Room":"Sala Pacinotti",
    "Scheduled At":"2025-04-12T10:00:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"b8b99b42-456a-4934-a1ac-414d4ba2990b"
  },
  {
    "Session Id":862668,
    "Title":"Come racconterò Kubernetes a mia figlia",
    "Description":"\"C'era una volta Bino, un elefantino che vendeva piume. E Bino voleva esplorare il mondo, e si avventurò per mare assieme a Ual, una balena che gli insegnò a stare su una zattera. Ma Bino voleva incontrare tanti altri animali, e conoscere il mondo, e poter essere veloce ed efficiente per vendere quante più piume possibile, fino a quando non incontrò una grande nave piena di promesse e magie._x000D_\nKubernetes è un sistema complesso e per nulla scontato. Risulta quasi impossibile spiegarne il funzionamento interno ai non addetti ai lavori, ma le favole ci permettono di usare la fantasia per trasformare concetti solitamente complessi in qualcosa di magico. In questo talk vi racconterò meccanismi dell'orchestrazione dei container così come intendo farlo con mia figlia tra qualche anno, sfruttando la magia delle favole.\"",
    "Owner":"Gregorio Palamà",
    "Owner Email":"gregoriopalama@gmail.com",
    "Speakers":"Gregorio Palamà",
    "Category":"Cloud",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"Yes, and I will be applying with Google's speaker program",
    "Country":"Italia",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-03-14T10:57:25.880",
    "Room":"Sala Gentili",
    "Scheduled At":"2025-04-12T10:00:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"3d9a3287-cc36-4428-b6b4-1dd1df1e70e8"
  },
  {
    "Session Id":862926,
    "Title":"Flutter and Game Development: Where to Begin?",
    "Description":"What is Flutter? Can you learn this framework by building a video game from scratch? Or, as a Flutter mobile developer, can you leverage your skills to create cross-platform games?_x000D_\n_x000D_\nIn this introductory talk, we’ll explore Flutter - Google’s powerful open-source framework - from a different perspective. We’ll discuss the challenges you might face and the first steps to take when stepping into the magical world of game creation with Flutter.",
    "Owner":"Mirko Raimo",
    "Owner Email":"mirko.raimo@gmail.com",
    "Speakers":"Mirko Raimo",
    "Category":"Mobile",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T20:38:54.387",
    "Room":"Sala Ricci",
    "Scheduled At":"2025-04-12T10:00:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"9c03c115-4eb4-4ac9-a320-1ab3ef9f6a04"
  },
  {
    "Session Id":797393,
    "Title":"Your app at a Glance: App Widgets in Compose",
    "Description":"Widgets have been a part of Android since its beginning, but their diffusion has often been kept back by a complex development process. _x000D_\nThat has changed with Jetpack Glance, a modern framework powered by Jetpack Compose that significantly simplifies widget creation._x000D_\n_x000D_\nIn this talk, we'll journey through widgets, understanding what they are, what the common use cases are and how they works under the hood. _x000D_\n_x000D_\nWe'll also dive deep into Jetpack Glance, exploring its features and benefits.  But we won't stop at theory – we'll build a widget for an existing app, addressing real-world issues often overlooked in basic documentation.",
    "Owner":"Fabio Catinella",
    "Owner Email":"fablas94@gmail.com",
    "Speakers":"Fabio Catinella",
    "Category":"Mobile",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T09:59:31.543",
    "Room":"Sala Ricci",
    "Scheduled At":"2025-04-12T10:50:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"e715387d-ff3b-4559-bdc3-1ee34393d8e4"
  },
  {
    "Session Id":821974,
    "Title":"The Feedback Loop: Building a Culture of Growth and Improvement",
    "Description":"Effective feedback is the cornerstone of personal and team growth, yet delivering it constructively and receiving it openly can be challenging. Whether you're a team member, manager, or technical leader, mastering the art of empathetic feedback fosters trust, drives progress, and empowers teams to thrive._x000D_\n_x000D_\nIn this talk, we’ll uncover the core principles of effective feedback, emphasizing clarity, empathy, and actionable impact. We’ll explore how to navigate common pitfalls, strike the right balance between praise and critique, and adapt your approach to different personalities and situations.",
    "Owner":"Aldo D'Aquino",
    "Owner Email":"daquino.aldo@gmail.com",
    "Speakers":"Aldo D'Aquino",
    "Category":"Soft Skills",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T11:43:42.853",
    "Room":"Sala Fibonacci",
    "Scheduled At":"2025-04-12T10:50:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"18c211b7-c4a7-49d7-a7fc-0c006bc75e1a"
  },
  {
    "Session Id":838947,
    "Title":"Imparare la cybersecurity catturando bandiere",
    "Description":"In questo talk vedremo cosa è una competizione \"Capture the Flag\" (CTF), come usarle per imparare la security e l'informatica in generale, come la community Italiana si è sviluppata negli ultimi 5 anni e quanto possa essere importante per costruire dell'esperienza lavorativa",
    "Owner":"Aleandro Prudenzano",
    "Owner Email":"aleandro.prudenzano@gmail.com",
    "Speakers":"Aleandro Prudenzano",
    "Category":"Other",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T10:29:58.327",
    "Room":"Sala Gentili",
    "Scheduled At":"2025-04-12T10:50:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"2c1fe5c9-6ab7-46b6-a288-42b5dabbed7f"
  },
  {
    "Session Id":862301,
    "Title":"Storybook: l' Atomic Design oltre il wormhole 🌪️",
    "Description":"Progettare interfacce utilizzando componenti modulari e riutilizzabili non è sempre facile e intuitivo. 🤯_x000D_\nCon Storybook, il viaggio nell'Atomic Design entra in una nuova dimensione, permettendoci di oltrepassare il wormhole del caos._x000D_\nIn questo talk, esploreremo come Storybook permetta di realizzare, adattare e documentare ogni singolo componente, offrendoci uno spazio dinamico per sviluppare e testare i componenti in modo isolato. Scopriremo come Storybook migliori la collaborazione tra le diverse parti del team, integrandosi anche con tool di progettazione e prototipazione grafica come Figma. Join with us! 🚀 ",
    "Owner":"Valentina Giuffre' Coco",
    "Owner Email":"giuffre.valentina.21@gmail.com",
    "Speakers":"Valentina Giuffre' Coco, Paolo Botti",
    "Category":"Web",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T10:42:32.957",
    "Room":"Sala Pacinotti",
    "Scheduled At":"2025-04-12T10:50:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"26ccbcbd-1d78-471c-b98e-fa7854526c2a, bbab3352-b233-4074-9e07-f8df51b61644"
  },
  {
    "Session Id":796625,
    "Title":"Introduzione al Quantum Computing",
    "Description":"Hai mai sentito parlare di Quantum Computing? Negli ultimi anni l'interesse per questo argomento è cresciuto notevolmente, ma cosa c'è davvero dietro? Che vantaggi può portarci? E quando potremo finalmente usarlo?_x000D_\nIn questo talk scopriremo insieme questo mondo misterioso rispondendo a queste e tante altre domande nel frattempo!",
    "Owner":"Giacomo Ranieri",
    "Owner Email":"jgiak92@gmail.com",
    "Speakers":"Giacomo Ranieri",
    "Category":"Other",
    "Session format":"Short (20min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T10:40:23.917",
    "Room":"Sala Pacinotti",
    "Scheduled At":"2025-04-12T11:40:00.000",
    "Scheduled Duration":30.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"a4b0383e-705e-4e23-9929-338c8e7783b0"
  },
  {
    "Session Id":854505,
    "Title":"More than Incognito: server-side secret searches",
    "Description":"Nowadays, privacy is a topic that comes up more and more often. Whenever you use a service or a platform, the provider typically knows exactly what you're doing and what you're interested in. But what if you don’t want the providers to know?_x000D_\n_x000D_\nIn this talk, we'll explore a different perspective on privacy, specifically, the scenario where you want to access data from a public database without revealing what you're looking for. We’ll discuss how this can be done, along with the advantages and disadvantages of the various solutions available to achieve this kind of privacy.",
    "Owner":"Mariagiovanna Rotundo",
    "Owner Email":"mariagiovannarotundo@gmail.com",
    "Speakers":"Mariagiovanna Rotundo",
    "Category":"Cloud",
    "Session format":"Short (20min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"No",
    "Owner Confirmed":"No",
    "Room":"Sala Fibonacci",
    "Scheduled At":"2025-04-12T11:40:00.000",
    "Scheduled Duration":30.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"f8ffd44d-f336-4c8c-baf7-b3ec73cfff60"
  },
  {
    "Session Id":860892,
    "Title":"Overlay and Arazzo: From API Definitions to API Experiences",
    "Description":"Do you feel your OpenAPI specifications are static and inflexible? Let's meet Overlay and Arazzo, two new specifications from the OpenAPI Initiative._x000D_\nOverlay provides a new way to tailor your existing OpenAPI specifications to different audiences or environments, without altering the original source. Arazzo, on the other hand, helps you document complex API interactions, making it easier for developers to understand and implement multi-step processes._x000D_\nThis session will show you how to use these specifications to enhance developer onboarding, streamline API governance, and drive greater adoption of your APIs.",
    "Owner":"Gloria Ciavarrini",
    "Owner Email":"gloria.ciavarrini@gmail.com",
    "Speakers":"Gloria Ciavarrini",
    "Category":"Web",
    "Session format":"Short (20min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"English, Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T13:05:52.770",
    "Room":"Sala Ricci",
    "Scheduled At":"2025-04-12T11:40:00.000",
    "Scheduled Duration":30.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"b1ee9ed2-fb20-4888-9d86-2835539d3528"
  },
  {
    "Session Id":883240,
    "Title":"WordPress come Headless CMS: Sfruttarlo al Meglio con Angular",
    "Description":"WordPress è il CMS più utilizzato al mondo, ma il suo approccio tradizionale può avere limiti in termini di performance e flessibilità. In questo talk, esploreremo come trasformarlo in un CMS headless, utilizzandolo solo come backend e integrandolo con un frontend moderno in Angular. Analizzeremo i vantaggi di questa architettura, come migliorare la scalabilità, ottimizzare le prestazioni e rendere il sito più dinamico e reattivo. Vedremo anche best practice, strumenti e casi d’uso reali per adottare al meglio questo approccio.",
    "Owner":"Chiara Aiola",
    "Owner Email":"aiola@netseven.it",
    "Speakers":"Chiara Aiola",
    "Category":"Web",
    "Session format":"Short (20min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italia",
    "Owner Informed":"No",
    "Owner Confirmed":"No",
    "Room":"Sala Gentili",
    "Scheduled At":"2025-04-12T11:40:00.000",
    "Scheduled Duration":30.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"b4ba51b6-abb9-435d-8b1e-35aa3469f736"
  },
  {
    "Session Id":824924,
    "Title":"Pixel and Particles: Generative Art meets Quantum Computing",
    "Description":"Since the 60s, computers have been used to create art in what is known as \"Generative Art\". In this talk we will be exploring how an emerging technology such as quantum computing can be applied to generative art and we will \"play\" with the randomness.",
    "Owner":"Juna Salviati",
    "Owner Email":"juna.salviati@gmail.com",
    "Speakers":"Juna Salviati",
    "Category":"Other",
    "Session format":"Short (20min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-27T09:46:12.603",
    "Room":"Sala Fibonacci",
    "Scheduled At":"2025-04-12T12:10:00.000",
    "Scheduled Duration":30.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"baa96c7b-6106-4cb5-8d88-124af5027adc"
  },
  {
    "Session Id":859518,
    "Title":"Il ruolo della Gen-AI nella data science geospaziale",
    "Description":"Le analisi geospaziali ormai godono di una storia ultra-decennale. La comunità dei data scientist che opera in questo settore ha attraversato tutte le rivoluzioni degli ultimi anni: dagli stravolgimenti dell'open-source al cambiamento dei paradigmi dei big-data, machine learning e blockchain. Anche la Gen-AI sta portando nuovi stravolgimenti sul fronte della geo-spatial data science._x000D_\nRipercorreremo in questo talk i passaggi storici e le nuove frontiere dei sistemi per analizzare dati provenienti da vari settori come Earth Observation, Remote Sensing e UAV.",
    "Owner":"Gianfranco Di Pietro",
    "Owner Email":"gianfrancodipietro@gmail.com",
    "Speakers":"Gianfranco Di Pietro",
    "Category":"Other",
    "Session format":"Short (20min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T10:34:50.483",
    "Room":"Sala Pacinotti",
    "Scheduled At":"2025-04-12T12:10:00.000",
    "Scheduled Duration":30.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"b2327cae-e253-4feb-8e14-241af6350778"
  },
  {
    "Session Id":859594,
    "Title":"A journey through the making of a new mobile app feature: from the idea to the customer",
    "Description":"In this presentation, we will go through the several steps needed to get from the initial design vision to the final mobile product on the market, using a feature we added recently as case study. We will look at the various challenges to be faced, such as platform-specific UI\/UX guidelines, accessibility and consistent branding UI elements. Finally, we will provide an overview of the processes and technologies used to refine the design and ensure the quality of our products.",
    "Owner":"Donatella Pasquale",
    "Owner Email":"donatella.pasquale@garmin.com",
    "Speakers":"Donatella Pasquale, Federico Matteoni",
    "Category":"Mobile",
    "Session format":"Short (20min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T12:38:29.113",
    "Room":"Sala Ricci",
    "Scheduled At":"2025-04-12T12:10:00.000",
    "Scheduled Duration":30.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"6b8ff0d1-1f43-49ee-9406-a3bd8605e2d2, 1f0a3264-44fb-4172-872e-38ba37f065ae"
  },
  {
    "Session Id":884731,
    "Title":"Problemi NP-hard e come affrontarli",
    "Description":"Molti problemi di interesse pratico rientrano nella famosa classe dei problemi NP-completi: si tratta di problemi difficili da risolvere, per i quali si conoscono solo algoritmi lenti, con un costo in tempo esponenziale._x000D_\nCosa possiamo fare, allora, quando ci troviamo di fronte a problemi di questo tipo?_x000D_\nPartendo dal caso specifico della sintesi logica delle funzioni booleane, mirata alla progettazione di circuiti integrati ottimizzati secondo criteri quali l'area occupata, il tempo di risposta, o la potenza assorbita, questo intervento si propone di descrivere due approcci per affrontare in pratica i problemi difficili: la ricerca di \"strutture regolari\" all'interno dei dati da elaborare e la possibilità di sfruttare la tolleranza agli errori di alcune applicazioni.",
    "Owner":"Anna Bernasconi",
    "Owner Email":"anna.bernasconi@unipi.it",
    "Speakers":"Anna Bernasconi",
    "Category":"Other",
    "Session format":"Short (20min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"No",
    "Owner Confirmed":"No",
    "Room":"Sala Gentili",
    "Scheduled At":"2025-04-12T12:10:00.000",
    "Scheduled Duration":30.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"527b2a7b-fd99-4ba2-a076-5703226fbf03"
  },
  {
    "Session Id":846889,
    "Title":"Crafting Digital Twins with an Actor Model in Rust",
    "Description":"Digital Twins represent a powerful paradigm for modelling complex IoT systems, yet practical implementations often fall short of theoretical promises. This talk cuts through the hype by demonstrating a robust approach based on an Actor Model pattern implemented in Rust, bridging the gap between conceptual frameworks and pragmatic engineering. Concurrency fundamentals, message-driven design patterns, and real-world use cases illustrate how Rust’s safety and performance guarantees enable maintainable, production-ready Digital Twin solutions.",
    "Owner":"Gianluca Insolvibile",
    "Owner Email":"g.insolvibile@nextworks.it",
    "Speakers":"Gianluca Insolvibile",
    "Category":"Other",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T10:27:05.633",
    "Room":"Sala Gentili",
    "Scheduled At":"2025-04-12T14:00:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"849b385a-5cc2-4a5e-a32e-b3e04c5ed10e"
  },
  {
    "Session Id":853115,
    "Title":"Personalizzare l'IA per il Diritto: Addestrare Modelli su Dataset Legali",
    "Description":"L’intelligenza artificiale può essere adattata per compiti specifici tramite il fine-tuning di modelli pre-addestrati, trasformandoli in strumenti altamente specializzati. In questo talk presenterò un progetto pratico basato su GPT-2, personalizzato per comprendere e generare testi giuridici, con un focus sull’interpretazione del Codice Civile e Penale e sulla creazione automatizzata di querele. Il progetto sfrutta tecnologie open source per ottimizzare un modello di linguaggio già esistente, rendendolo capace di rispondere a domande legali e generare documenti strutturati con un linguaggio formale e contestualizzato._x000D_\nDurante l’intervento illustrerò il workflow seguito, suddiviso in tre fasi principali. La prima riguarda la preparazione del dataset, che prevede l’estrazione dei testi normativi tramite web scraping e parsing, seguita dalla pulizia e tokenizzazione del testo con NLTK e Hugging Face Tokenizers, per garantire un’elaborazione efficace del linguaggio giuridico. La seconda fase si concentra sul fine-tuning di GPT-2, eseguito con PyTorch e TensorFlow per adattare il modello al dominio legale. Verranno ottimizzati iperparametri chiave come batch size, learning rate ed epoche, applicando tecniche di early stopping e gradient accumulation per migliorare le prestazioni su hardware limitato. Infine, nella terza fase, verrà presentata l’interfaccia web, sviluppata con Flask, che consente agli utenti di inserire domande giuridiche o descrivere un caso, ricevendo in risposta un’analisi legale dettagliata o una bozza di querela generata automaticamente dal modello._x000D_\nIl talk si concluderà con una demo live, dimostrando come la personalizzazione di GPT-2 possa trasformare un modello generico in uno strumento avanzato per il settore giuridico. L'obiettivo è mostrare come sia possibile adattare un LLM alle esigenze specifiche di qualsiasi organizzazione o settore.",
    "Owner":"Daniele Mario Areddu",
    "Owner Email":"danielemario@areddu.it",
    "Speakers":"Daniele Mario Areddu",
    "Category":"AI",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T10:02:30.903",
    "Room":"Sala Pacinotti",
    "Scheduled At":"2025-04-12T14:00:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"919f1380-f9b7-40ce-97a9-545be75734ae"
  },
  {
    "Session Id":857773,
    "Title":"How to give your first Talk without freaking out",
    "Description":"Public speaking can be intimidating: where do we start from? How to find the right topic? How to put together a nice presentation? Will the audience ask me questions? In this talk I will provide first hand tips I learned the hard way on how to go from zero to give your first public talk with confidence._x000D_\n",
    "Owner":"Federico Paolinelli",
    "Owner Email":"fedepaol@gmail.com",
    "Speakers":"Federico Paolinelli",
    "Category":"Soft Skills",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T14:17:55.593",
    "Room":"Sala Fibonacci",
    "Scheduled At":"2025-04-12T14:00:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"d26a7c22-25fc-466d-89ff-c0a77c93f820"
  },
  {
    "Session Id":857916,
    "Title":"Beats in the Browser - Coding Music with JavaScript",
    "Description":"Javascript is extremely versatile. We use it to build frontend, backend, desktop and mobile apps. But did you know you can even create music with it ?!_x000D_\n_x000D_\nIn this talk, Rowdy will show you how easy and fun it is to code your own music with the Web Audio API. As a bonus, he will throw in the Web MIDI API and Web Bluetooth API to really get the party started. Let’s turn up the bass!",
    "Owner":"Rowdy Rabouw",
    "Owner Email":"hi@rowdy.codes",
    "Speakers":"Rowdy Rabouw",
    "Category":"Web",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"English",
    "Are you a Google employee or GDE?":"Yes, and I will be applying with Google's speaker program",
    "Country":"The Netherlands",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T10:19:25.820",
    "Room":"Sala Ricci",
    "Scheduled At":"2025-04-12T14:00:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"f5c30de4-cd93-4022-97f6-b0a58c92197c"
  },
  {
    "Session Id":822693,
    "Title":"La Musica Del Malware",
    "Description":"Ciao CVEs, miei vecchi amici, sono venuto a occuparmi di nuovo di voi perché una backdoor si insinua silenziosamente... Ops, scusate, stavamo cantando a squarciagola._x000D_\nÈ una cosa che continuiamo a fare ogni volta che una nuova vulnerabilità irrompe nella nostra routine quotidiana. Ultimamente è successo sempre più spesso a causa delle dipendenze del nostro software._x000D_\nLog4J, avete detto? Oh, beh, non dimentichiamoci di XZUtils! Li chiamano attacchi alla catena di distribuzione. Abbiamo iniziato ad affrontarli a ritmo di SLSA (leggi “salsa”), ma poi abbiamo notato che potevamo fare di più. Molto di più! E abbiamo trasformato i nostri binari malevoli in... beh, in forme d'onda. E abbiamo iniziato a farli dondolare!_x000D_\nLeggendo questi binari come se fossero normali forme d'onda e analizzandoli con un po' di matematica (Cepstum, serie di Fourier, ecc.) abbiamo creato un modello che mira a rilevare se una dipendenza è dannosa. E anche di classificarla in base al tipo di malware. Affascinante, vero? Il suono del malware...",
    "Owner":"Luca Di Vita",
    "Owner Email":"lucadivita.ldv@gmail.com",
    "Speakers":"Luca Di Vita, Gregorio Palamà",
    "Category":"AI",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italia",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-27T08:20:54.710",
    "Room":"Sala Pacinotti",
    "Scheduled At":"2025-04-12T14:50:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"96c13f58-033e-4f7a-8401-edcc8370009b, 3d9a3287-cc36-4428-b6b4-1dd1df1e70e8"
  },
  {
    "Session Id":837938,
    "Title":"Sailing the Waters using UI\/UX Reinforced by Security",
    "Description":"Everyone! You will always remember this day as the day that changed your perspective on security and UI\/UX. Today, we set sail to discover the hidden treasures of these two islands. How many times don’t you hear that they are as different as day and night? But what if I told you they need each other, like a pirate ship and its sails! _x000D_\n_x000D_\nRemember, every great voyage begins with a single step. So, hoist the sails and set forth on an adventure of discovery. Together, we'll uncover the secrets that will make your designs not just functional, but extraordinary. Join Mike in this deep dive into the intersection of security and user interaction\/experience, where we’ll unearth strategies that ensure your applications are both safe and user-friendly. This is a golden treasure trove filled with knowledge! _x000D_\n_x000D_\nNot all treasure is silver and gold, my companions! But this session is a treasure you don’t want to miss!",
    "Owner":"Mike van der Bijl",
    "Owner Email":"mikevanderbijl@xs4all.nl",
    "Speakers":"Mike van der Bijl",
    "Category":"Web",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"Netherlands",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T10:23:47.783",
    "Room":"Sala Ricci",
    "Scheduled At":"2025-04-12T14:50:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"b3788766-6842-4297-9dc2-f4f09ebe14d6"
  },
  {
    "Session Id":849512,
    "Title":"Boost your LLM-based application with a RAG system",
    "Description":"Unlock the true potential of your Large Language Model (LLM) applications with Retrieval-Augmented Generation (RAG), a groundbreaking approach that blends advanced information retrieval with AI text generation. This session dives into how RAG transforms LLM capabilities, enhancing the reliability of generated responses by drawing on a rich base of external knowledge._x000D_\n_x000D_\nDiscover why RAG is so captivating; it transcends traditional LLM limitations, minimizing inaccuracies and greatly reducing the occurrence of \"hallucinations\"—where LLMs generate plausible yet incorrect information. You will be equipped to construct your own RAG system using an LLM orchestrator through hands-on examples. Learn the inner workings by comparing popular frameworks like Haystack, Langchain, and LlamaIndex, each offering unique benefits and features for implementing a robust RAG architecture._x000D_\n_x000D_\nBy the end of this session, you'll master the practical skills needed to design and implement a high-performance RAG system tailored to your specific needs, boosting the effectiveness of your LLM-based applications and truly maximizing their potential.",
    "Owner":"Tommaso Radicioni",
    "Owner Email":"tommaso.radicioni@aiknowyou.ai",
    "Speakers":"Tommaso Radicioni",
    "Category":"AI",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T10:21:35.517",
    "Room":"Sala Gentili",
    "Scheduled At":"2025-04-12T14:50:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"23778c1e-25bf-477e-b1bd-a577b88a1205"
  },
  {
    "Session Id":907569,
    "Title":"K-nearest-neighbor query e come usarla su Firebase",
    "Description":"Negli ultimi anni, le ricerche semantiche basate su intelligenza artificiale sono passate da teoria accademica a strumenti pronti all'uso._x000D_\n_x000D_\nIn questo talk esploreremo come integrare la ricerca vettoriale in progetti Firebase, partendo dai concetti fondamentali fino all'implementazione concreta. Vedremo come salvare gli embedding, configurare un indice, ed eseguire query basate sulla similarità.",
    "Owner":"Camillo Bucciarelli",
    "Owner Email":"bucciarelli.camillo92@gmail.com",
    "Speakers":"Camillo Bucciarelli",
    "Category":"AI",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"No",
    "Owner Confirmed":"No",
    "Room":"Sala Fibonacci",
    "Scheduled At":"2025-04-12T14:50:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"c1f5a2da-9168-4e08-92a3-89cd792ca36a"
  },
  {
    "Session Id":813458,
    "Title":"Form inclusivi: l'importanza dei dettagli nascosti",
    "Description":"I form sono spesso la porta d'ingresso ai servizi online. Come possiamo renderli più inclusivi per gli utenti?_x000D_\nProgettare e sviluppare un form inclusivo richiede una serie di considerazioni da fare nelle varie fasi del processo di realizzazione, che spesso vengono ignorate o date per scontate._x000D_\nScopriamo insieme come ridefinire un form e renderlo più inclusivo.",
    "Owner":"Loredana Frontino",
    "Owner Email":"lory.frontino@gmail.com",
    "Speakers":"Loredana Frontino",
    "Category":"Web",
    "Session format":"Short (20min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T10:28:57.490",
    "Room":"Sala Fibonacci",
    "Scheduled At":"2025-04-12T15:40:00.000",
    "Scheduled Duration":25.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"71dba3f8-a0f9-4301-a3a7-d699aa1a182b"
  },
  {
    "Session Id":863339,
    "Title":"Verso una logistica intelligente: AI e Apprendimento Federato per ottimizzare processi logistici",
    "Description":"L’Intelligenza Artificiale sta trasformando il settore logistico, migliorando l’efficienza operativa e riducendo i costi. In questo talk esploreremo come le moderne tecniche di machine learning possano essere applicate all’ottimizzazione logistica, focalizzandoci su un caso d’uso concreto: la predizione delle parti di ricambio per interventi di manutenzione e riparazione di elettrodomestici._x000D_\nEsamineremo diverse strategie per la raccomandazione delle parti di ricambio ai tecnici, partendo da un primo approccio basato su Case-Based Reasoning e Natural Language Processing. Vedremo poi come l’integrazione del Deep Learning abbia migliorato significativamente l’accuratezza della predizione, riducendo il numero di visite necessarie per completare una riparazione._x000D_\nSuccessivamente introdurremo il Federated Learning, un paradigma proposto da Google che consente di addestrare modelli predittivi più efficaci in modo distribuito, permettendo a più aziende operanti nello stesso settore di collaborare senza condividere dati sensibili. Discuteremo come abbiamo applicato questa tecnologia per migliorare ulteriormente la predizione dei ricambi, ottenendo modelli con migliori capacità di generalizzazione e benefici concreti in scenari reali._x000D_\nConcluderemo offrendo una breve panoramica sulle attività del Laboratorio IT2PAO, il laboratorio di ricerca congiunto tra l’Università di Pisa e LogObject, dove stiamo esplorando ulteriori applicazioni dell’AI per l’ottimizzazione dei processi logistici e oltre._x000D_\nQuesto talk fornirà una visione chiara sulle sfide e opportunità dell’Intelligenza Artificiale nel mondo della logistica, con un focus sulle tecnologie più recenti e sulle loro implicazioni pratiche._x000D_\n",
    "Owner":"Alessio Schiavo",
    "Owner Email":"alessio.schiavo@phd.unipi.it",
    "Speakers":"Alessio Schiavo",
    "Category":"AI",
    "Session format":"Short (20min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italia",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-28T08:50:14.210",
    "Room":"Sala Pacinotti",
    "Scheduled At":"2025-04-12T15:40:00.000",
    "Scheduled Duration":25.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"cdc81ad6-0f52-4e99-87b3-a95ab9863b1a"
  },
  {
    "Session Id":863474,
    "Title":"Extending Kubernetes: Building torproxy for Anonymous Container Communication",
    "Description":"torproxy is an open source Kubernetes controller written in Go to enable tor utilities in your k8s cluster. _x000D_\nWe will go through the implementation of a generic controller, taking as example the torproxy._x000D_\nThe audience will learn more about writing kubernetes controllers, know more about tor network, Go language patterns ",
    "Owner":"Fulvio Denza",
    "Owner Email":"fulviodenza823@gmail.com",
    "Speakers":"Fulvio Denza",
    "Category":"Cloud",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"Spain",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T11:33:18.073",
    "Room":"Sala Gentili",
    "Scheduled At":"2025-04-12T15:40:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"fc2a3a72-76e2-4a5d-b05b-cf02838714e5"
  },
  {
    "Session Id":863806,
    "Title":"How I ported Doom to the browser with WebAssembly",
    "Description":"WASM is a powerful platform-agnostic technology. Do you know that you can take advantage of it to port games to the browser as long as the source code can be compiled to WASM? In that regard, I ported DOOM to the Browser thanks to .Net support of WASM._x000D_\n_x000D_\nI this talk, I will share with you how I managed to develop the port from a pure C# + SAML codebase to a mix of C# + JS. I'll show the process that I followed so that you can reproduce it for any similar game. I'll also share the issues that I encountered along the way and how I solved them._x000D_\n_x000D_\nThe concepts that I'll present can be applied to any language that targets WASM. So, come and live this porting adventure with me👍.",
    "Owner":"Yassine Benabbas",
    "Owner Email":"yostane@yahoo.fr",
    "Speakers":"Yassine Benabbas",
    "Category":"Web",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"France",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T11:07:45.720",
    "Room":"Sala Ricci",
    "Scheduled At":"2025-04-12T15:40:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"53bb8035-14c0-479a-9c9d-cc7c9b50c6ff"
  },
  {
    "Session Id":862602,
    "Title":"Superhero Valley: tips and tricks per un futuro in Big Tech",
    "Description":"Se hai mai sognato di lavorare in Big Tech, questo talk è per te! _x000D_\n_x000D_\nAbbiamo raccolto consigli pratici e insight esclusivi da dipendenti che hanno vissuto in prima persona il percorso di selezione per entrare in azienda come Google, Meta o Microsoft. Ti forniremo suggerimenti concreti su come prepararsi e affrontare una delle sfide più ambite nel mondo tech._x000D_\n_x000D_\nCosa scoprirai:_x000D_\n- Quali competenze fanno davvero la differenza. _x000D_\n- Cosa avere nel tuo CV per metterti in evidenza durante il processo di selezione._x000D_\n- Come affrontare coding interviews e domande comportamentali con sicurezza._x000D_\n- Strategie per costruire un profilo professionale in grado di attirare l'attenzione dei recruiter.",
    "Owner":"Francesco Paolo Liuzzi",
    "Owner Email":"liuzzifrancescopaolo@gmail.com",
    "Speakers":"Francesco Paolo Liuzzi",
    "Category":"Soft Skills",
    "Session format":"Short (20min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T10:12:44.157",
    "Room":"Sala Pacinotti",
    "Scheduled At":"2025-04-12T16:05:00.000",
    "Scheduled Duration":25.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"32e74714-8c73-48bb-a672-e2a1b285a537"
  },
  {
    "Session Id":885792,
    "Title":"🔧✨ Dietro le quinte dell’Animazione: il ruolo del Technical Director 🎬💡",
    "Description":"Guardando un prodotto d’animazione, vi siete mai chiesti: “ma come fanno a realizzarlo?”. Dietro ogni produzione in CGI si cela un’enorme macchina organizzativa, in cui creatività, programmazione e problem-solving si intrecciano per dare vita a mondi straordinari._x000D_\n_x000D_\nAl centro di questo processo c’è una figura chiave, spesso poco conosciuta ma essenziale per il successo di ogni progetto: il Technical Director (TD)._x000D_\n_x000D_\nIn questo talk esploreremo il ruolo cruciale del TD nell'animazione moderna, scoprendo le sue responsabilità e il suo impatto sulla pipeline di produzione. Analizzeremo le sfide quotidiane e gli strumenti più usati in questo ambito, buttando un occhio sulle tecnologie emergenti che stanno rivoluzionando il settore._x000D_\n_x000D_\nSe vi appassionano l’animazione, lo sviluppo software e la tecnologia applicata alla creatività, questo talk vi offrirà uno sguardo esclusivo su una delle professioni più dinamiche e richieste nel mondo dell’entertainment digitale 🚀🎬",
    "Owner":"Silvia Raggi",
    "Owner Email":"silvia.raggi.21@gmail.com",
    "Speakers":"Silvia Raggi",
    "Category":"Other",
    "Session format":"Short (20min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"No",
    "Owner Confirmed":"No",
    "Room":"Sala Fibonacci",
    "Scheduled At":"2025-04-12T16:05:00.000",
    "Scheduled Duration":25.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"7869365c-0ad9-41ad-99cc-a87ad0f5ccf6"
  },
  {
    "Session Id":857452,
    "Title":"What I learned from Five Years of Advent of Code in Kotlin",
    "Description":"For the past five years, Advent of Code has been my December ritual: a month-long challenge of solving programming puzzles. From a funny routine, It slowly became part of my learning journey in discovering all the capabilities of my favorite programming language: Kotlin._x000D_\n_x000D_\nIn this session, I’ll share what is Advent of Code: not just a holiday coding challenge. It’s the yearly opportunity to challenge yourself and learn new programming tricks. Whether you're preparing for coding interviews or just love solving puzzles, Advent of Code can make a difference on your growth._x000D_\n_x000D_\nAnd you might be wondering: why Kotlin? With its concise syntax, powerful standard library, and functional programming features, Kotlin really shines in solving Advent of Code puzzles. In this session, I'll walk you through some real examples, showing how Kotlin makes tackling the Advent of Code easier and enjoyable!",
    "Owner":"Nicola Corti",
    "Owner Email":"corti.nico@gmail.com",
    "Speakers":"Nicola Corti",
    "Category":"Mobile",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"English",
    "Are you a Google employee or GDE?":"Yes, and I will be applying with Google's speaker program",
    "Country":"United Kingdom",
    "Owner Informed":"2025-02-07T12:10:43.213",
    "Owner Confirmed":"2025-02-07T12:55:57.113",
    "Room":"Sala Ricci",
    "Scheduled At":"2025-04-12T17:00:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"8730d40b-3fb7-450d-ab71-08c9dd81a48a"
  },
  {
    "Session Id":861129,
    "Title":"Addestra il tuo LLM a pensare con GRPO — ora anche su piccole GPU!",
    "Description":"DeepSeek R1, uno dei large language model più discussi del momento, ha introdotto GRPO, un nuovo algoritmo di reinforcement learning che permetterebbe di addestrare modelli che \"ragionano\". Ma è davvero così?_x000D_\nDurante questo talk vedremo in cosa consiste l'algoritmo e come è possibile usarlo per trasformare piccoli LLMs in reasoning models. Inoltre, grazie a Unsloth, potremo replicare questo esperimento con modelli fino a 15B parametri anche non dispondendo di GPU potenti!",
    "Owner":"Michele Sponsale",
    "Owner Email":"michelesponsale@gmail.com",
    "Speakers":"Michele Sponsale",
    "Category":"AI",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Intermediate",
    "Language":"Italian",
    "Are you a Google employee or GDE?":null,
    "Country":"Italy",
    "Owner Informed":"No",
    "Owner Confirmed":"No",
    "Room":"Sala Pacinotti",
    "Scheduled At":"2025-04-12T17:00:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"75b4f159-81e6-403d-8c00-641b4eb73226"
  },
  {
    "Session Id":864118,
    "Title":"OTEL: How I Learned to Stop Worrying and Love My Microservices",
    "Description":"Microservices often get a bad rap for being complex, brittle, and hard to debug. What if the real problem isn’t the architecture, but the lack of visibility?_x000D_\nWith proper observability, even the most labyrinthine microservice can be tamed._x000D_\n_x000D_\nThat’s where OpenTelemetry (OTEL) comes in. By instrumenting tracing, metrics, and logs, it can shed light on the dark corners of your system,_x000D_\nturning confusion into clarity. In this talk, we’ll explore how OTEL helps teams regain control, share lessons from real-world deployments, and show how proper observability alleviate the headaches of using microservices._x000D_\n_x000D_\nIf you’ve ever questioned your life choices while debugging a distributed system, this talk is for you. With the right observability strategy, you might just learn to love your microservices!",
    "Owner":"Antonino Cangialosi",
    "Owner Email":"ninocangialosi@yahoo.it",
    "Speakers":"Antonino Cangialosi",
    "Category":"Web",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T19:21:40.200",
    "Room":"Sala Gentili",
    "Scheduled At":"2025-04-12T17:00:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"5db6077d-3a44-4a06-a48c-e19d5976d7f8"
  },
  {
    "Session Id":893277,
    "Title":"The Courage to Be Different: Rewriting the STEM Narrative",
    "Description":"In \"The Courage to Be Different: Rewriting the STEM Narrative,\" Carmen will share her personal journey through the world of STEM, particularly engineering, from the early struggles of challenges, failed exams, and long study days to graduating and conducting research aimed at improving people's lives and changing the world. She will highlight the importance of embracing individuality and challenging conventional ideas and misconceptions about who belongs in STEM. Through her story, she hopes to inspire others to break free from limiting narratives and courageously carve their own path in STEM, proving that diversity of thought and experience is the key to unlocking innovation. By expanding our understanding of who can contribute to STEM, we can reshape the field and become role models for future generations. ",
    "Owner":"Carmen Panepinto Zayati",
    "Owner Email":"carmenpanepintozayati@gmail.com",
    "Speakers":"Carmen Panepinto Zayati",
    "Category":"Soft Skills",
    "Session format":"Short (20min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"No",
    "Owner Confirmed":"No",
    "Room":"Sala Fibonacci",
    "Scheduled At":"2025-04-12T17:00:00.000",
    "Scheduled Duration":25.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"04f80ad2-8117-4df5-9695-f19d0ebd9c25"
  },
  {
    "Session Id":906036,
    "Title":"Redefine Possible: donne in STEM",
    "Description":"Redefine Possible è il tema dell'IWD 2025, ma cosa significa? Come è percepito il \"possibile\" da figure femminili che lavorano in ambito STEM?_x000D_\nIn questa sessione, 3 speaker verranno intervistate, ognuna rappresentante un diverso settore STEM, per condividere la propria esperienza e discutere diversità e inclusione sul posto di lavoro.",
    "Owner":"Mariagiovanna Rotundo",
    "Owner Email":"mariagiovannarotundo@gmail.com",
    "Speakers":"Loredana Frontino, Anna Bernasconi, Carmen Panepinto Zayati, Silvia Raggi",
    "Category":"Other",
    "Session format":"Short (20min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"Italian",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"No",
    "Owner Confirmed":"No",
    "Room":"Sala Fibonacci",
    "Scheduled At":"2025-04-12T17:25:00.000",
    "Scheduled Duration":25.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"71dba3f8-a0f9-4301-a3a7-d699aa1a182b, 527b2a7b-fd99-4ba2-a076-5703226fbf03, 04f80ad2-8117-4df5-9695-f19d0ebd9c25, 7869365c-0ad9-41ad-99cc-a87ad0f5ccf6"
  },
  {
    "Session Id":826068,
    "Title":"AI’s Hidden Cost: The Environmental Impact of Machine Learning",
    "Description":"The rise of Generative AI has led us to use tools that are slowly changing how we work._x000D_\n_x000D_\nTraining the AI models demands significant resources, including vast amounts of water and energy. In this talk, we’ll uncover the hidden costs of AI on the environment and discuss solutions that have emerged in recent years. _x000D_\n_x000D_\nJoin me in exploring how to make AI more sustainable and discovering how we can reduce its environmental impact while continuing to advance the field.",
    "Owner":"Luca Corbucci",
    "Owner Email":"corbuccilu@gmail.com",
    "Speakers":"Luca Corbucci",
    "Category":"AI",
    "Session format":"Full (40min)",
    "Session duration (workshops)":null,
    "Level":"Introductory",
    "Language":"English",
    "Are you a Google employee or GDE?":"No",
    "Country":"Italy",
    "Owner Informed":"2025-02-26T09:49:50.643",
    "Owner Confirmed":"2025-02-26T10:08:09.363",
    "Room":"Sala Ricci",
    "Scheduled At":"2025-04-12T17:50:00.000",
    "Scheduled Duration":50.0,
    "Live Link":null,
    "Recording Link":null,
    "Speaker Ids":"bc0733bf-ef2a-47ad-aff9-20ce0371d96d"
  }
]